## Load_Restaurant

In [1]:
pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\admin\anaconda3\lib\site-packages (4.0.0-unsupported)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pyodbc
import pandas as pd

In [3]:
pyodbc.drivers()

['SQL Server',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'Amazon Redshift (x64)',
 'SQL Server Native Client 11.0',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server']

In [4]:
conn = pyodbc.connect(
    Trusted_Connection='Yes',
    Driver=' {ODBC Driver 17 for SQL Server}',
    Server='DESKTOP-QFU7Q90\SQLEXPRESS',
    Database='testdatabase'
)
cursor = conn. cursor()

In [5]:
data=pd.read_excel(r"C:\Users\admin\Desktop\EY Assesment\PBI_Restaurant_in_India.xlsx",sheet_name = "Restaurant")

In [6]:
data.head()

,Res_Id,Rest_Name,Type,Cuisines,Timing,Services
0,3400299,Farsanwala,['Quick Bites'],"North Indian, South Indian, Mithai, Street Foo...",8:30am â€“ 10:30pm (Mon-Sun),"['Lunch', 'Takeaway Available', 'Credit Card',..."
1,3400005,Murgi and Franky House,['Quick Bites'],"North Indian, Mughlai, Rolls, Chinese, Fast Fo...","12:30PM to 12Midnight (Mon, Wed, Thu, Fri, Sat...","['Delivery', 'No Alcohol Available', 'Dinner',..."
2,3401013,Halwai ka khajana,['Quick Bites'],"Fast Food, Mithai",9:30 AM to 11 PM,"['No Alcohol Available', 'Dinner', 'Takeaway A..."
3,3400290,Halwai ka khajana,['Quick Bites'],"Desserts, Bakery, Fast Food, South Indian",8am â€“ 11pm (Mon-Sun),"['Takeaway Available', 'Credit Card', 'Lunch',..."
4,3401744,Opal Kitchen Cafe and Bar,['Casual Dining'],"North Indian, Continental, Italian",11:30 AM to 11:30 PM,"['Lunch', 'Serves Alcohol', 'Cash', 'Credit Ca..."

In [7]:
print('Rows     :',data.shape[0])
print('Columns  :',data.shape[1])
print('\nFeatures :\n     :',data.columns.tolist())
print('\nMissing values    :',data.isnull().values.sum()) #for finding null values in the following dataset.
print('\nUnique values :  \n',data.nunique())
print('\nStatical Measure of the data set   :\n',data.describe()) # Statically computed values of the dataset.

Rows     : 211944
Columns  : 6

Features :
     : ['Res_Id', 'Rest_Name', 'Type', 'Cuisines', 'Timing', 'Services']

Missing values    : 5265

Unique values :
 Res_Id       55568
Rest_Name    41097
Type            27
Cuisines      9382
Timing        7740
Services     31455
dtype: int64

Statical Measure of the data set   :
              Res_Id
count  2.119440e+05
mean   1.349411e+07
std    7.883722e+06
min    5.000000e+01
25%    3.301027e+06
50%    1.869573e+07
75%    1.881297e+07
max    1.915979e+07

In [8]:
#Null Check
data.isnull().sum()

Res_Id          0
Rest_Name       0
Type            0
Cuisines     1391
Timing       3874
Services        0
dtype: int64

In [9]:
df = data.fillna(0)

In [10]:
#Null Check
df.isnull().sum()

Res_Id       0
Rest_Name    0
Type         0
Cuisines     0
Timing       0
Services     0
dtype: int64

In [11]:
cursor.execute("CREATE TABLE Restraunt(Res_Id int,Rest_Name varchar(200), Type varchar(200), Cuisines varchar(200), Timing varchar(1000),Services varchar(1000))")

In [12]:
for row in df.itertuples():
    cursor.execute('''
    INSERT INTO testdatabase.dbo.Restraunt(Res_Id, Rest_Name, Type, Cuisines, Timing, Services)
    VALUES(?,?,?,?,?,?)
    ''',
    row.Res_Id,
    row.Rest_Name,
    row.Type,
    row.Cuisines,
    row.Timing,
    row.Services               
    )
conn.commit()

## Load_Factors

In [4]:
import pyodbc
import pandas as pd

In [5]:
pyodbc.drivers()

['SQL Server',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'Amazon Redshift (x64)',
 'SQL Server Native Client 11.0',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server']

In [6]:
conn = pyodbc.connect(
    Trusted_Connection='Yes',
    Driver=' {ODBC Driver 17 for SQL Server}',
    Server='DESKTOP-QFU7Q90\SQLEXPRESS',
    Database='testdatabase'
)
cursor = conn. cursor()

In [8]:
df1=pd.read_excel(r"C:\Users\admin\Desktop\EY Assesment\PBI_Restaurant_in_India.xlsx",sheet_name = "Factors")

In [9]:
df1.head()

,Res_Id,Rest_Name,Average_Cost_Two,Price_Range,Aggregate_Rating,Rating_Text,Votes,Photo_Count,Outdoor_Dining,Delivery,Takeaway
0,3400299,Farsanwala,700,2,4.4,Very Good,814,154,0,0,1
1,3400005,Murgi and Franky House,600,2,4.4,Very Good,1203,161,0,1,1
2,3401013,Halwai ka khajana,300,1,4.2,Very Good,801,107,1,1,1
3,3400290,Halwai ka khajana,300,1,4.3,Very Good,693,157,0,1,1
4,3401744,Opal Kitchen Cafe and Bar,1000,3,4.9,Excellent,470,291,1,0,0

In [10]:
print('Rows     :',df1.shape[0])
print('Columns  :',df1.shape[1])
print('\nFeatures :\n     :',df1.columns.tolist())
print('\nMissing values    :',df1.isnull().values.sum()) #for finding null values in the following dataset.
print('\nUnique values :  \n',df1.nunique())
print('\nStatical Measure of the data set   :\n',df1.describe()) # Statically computed values of the dataset.

Rows     : 211944
Columns  : 11

Features :
     : ['Res_Id', 'Rest_Name', 'Average_Cost_Two', 'Price_Range', 'Aggregate_Rating', 'Rating_Text', 'Votes', 'Photo_Count', 'Outdoor_Dining', 'Delivery', 'Takeaway']

Missing values    : 0

Unique values :
 Res_Id              55568
Rest_Name           41097
Average_Cost_Two      145
Price_Range             4
Aggregate_Rating       33
Rating_Text            39
Votes                2644
Photo_Count          2514
Outdoor_Dining          2
Delivery                2
Takeaway                2
dtype: int64

Statical Measure of the data set   :
              Res_Id  Average_Cost_Two    Price_Range  Aggregate_Rating  \
count  2.119440e+05     211944.000000  211944.000000     211944.000000
mean   1.349411e+07        595.812229       1.882535          3.395937
std    7.883722e+06        606.239363       0.892989          1.283642
min    5.000000e+01          0.000000       1.000000          0.000000
25%    3.301027e+06        250.000000       1.000000          3.300000
50%    1.869573e+07        400.000000       2.000000          3.800000
75%    1.881297e+07        700.000000       2.000000          4.100000
max    1.915979e+07      30000.000000       4.000000          4.900000

               Votes    Photo_Count  Outdoor_Dining       Delivery  \
count  211944.000000  211944.000000   211944.000000  211944.000000
mean      378.001864     256.971224        0.002062       0.456890
std       925.333370     867.668940        0.045361       0.498139
min       -18.000000       0.000000        0.000000       0.000000
25%        16.000000       3.000000        0.000000       0.000000
50%       100.000000      18.000000        0.000000       0.000000
75%       362.000000     128.000000        0.000000       1.000000
max     42539.000000   17702.000000        1.000000       1.000000

            Takeaway
count  211944.000000
mean        0.853726
std         0.353382
min         0.000000
25%         1.000000
50%         1.000000
75%         1.000000
max         1.000000

In [11]:
#Null Check
df1.isnull().sum()

Res_Id              0
Rest_Name           0
Average_Cost_Two    0
Price_Range         0
Aggregate_Rating    0
Rating_Text         0
Votes               0
Photo_Count         0
Outdoor_Dining      0
Delivery            0
Takeaway            0
dtype: int64

In [13]:
cursor.execute("CREATE TABLE Factors(Res_Id int,Rest_Name varchar(200), Average_Cost_Two varchar(200), Price_Range varchar(200), Aggregate_Rating varchar(1000),Rating_Text varchar(1000),Votes int,Photo_Count int,Outdoor_Dining int,Delivery int,Takeaway int)")

In [16]:
for row in df1.itertuples():
    cursor.execute('''
    INSERT INTO testdatabase.dbo.Factors(Res_Id, Rest_Name, Average_Cost_Two, Price_Range, Aggregate_Rating, Rating_Text, Votes, Photo_Count, Outdoor_Dining, Delivery, Takeaway)
    VALUES(?,?,?,?,?,?,?,?,?,?,?)
    ''',
    row.Res_Id,
    row.Rest_Name,
    row.Average_Cost_Two,
    row.Price_Range,
    row.Aggregate_Rating,
    row.Rating_Text,
    row.Votes,
    row.Photo_Count,
    row.Outdoor_Dining,
    row.Delivery,
    row.Takeaway,
    )
conn.commit()

## Load_Location

In [69]:
import pyodbc
import pandas as pd

In [70]:
pyodbc.drivers()

['SQL Server',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'Amazon Redshift (x64)',
 'SQL Server Native Client 11.0',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server']

In [71]:
conn = pyodbc.connect(
    Trusted_Connection='Yes',
    Driver=' {ODBC Driver 17 for SQL Server}',
    Server='DESKTOP-QFU7Q90\SQLEXPRESS',
    Database='testdatabase'
)
cursor = conn. cursor()

In [72]:
df4=pd.read_excel(r"C:\Users\admin\Desktop\EY Assesment\PBI_Restaurant_in_India.xlsx",sheet_name = "Location")

In [73]:
df4.head()

,Res_Id,Rest_Name,Address,City - CityID,Region,Latitude,Longitude,PinCode,Region_Verbose
0,3400299,Farsanwala,"Kalyani Point, Near Tulsi Cinema, Bypass Road,...",Agra-34,Khandari,27.211450,78.002381,NaN,"Khandari, Agra"
1,3400005,Murgi and Franky House,"Main Market, Sadar Bazaar, Agra Cantt, Agra",Agra-34,Agra Cantt,27.160569,78.011583,282001,"Agra Cantt, Agra"
2,3401013,Halwai ka khajana,"62/1, Near Easy Day, West Shivaji Nagar, Goalp...",Agra-34,Shahganj,27.182938,77.979684,282010,"Shahganj, Agra"
3,3400290,Halwai ka khajana,"Near Anjana Cinema, Nehru Nagar, Civil Lines, ...",Agra-34,Civil Lines,27.205668,78.004799,282002,"Civil Lines, Agra"
4,3401744,Opal Kitchen Cafe and Bar,"1C,3rd Floor, Fatehabad Road, Tajganj, Agra",Agra-34,Tajganj,27.157709,78.052421,NaN,"Tajganj, Agra"

In [74]:
print('Rows     :',df4.shape[0])
print('Columns  :',df4.shape[1])
print('\nFeatures :\n     :',df4.columns.tolist())
print('\nMissing values    :',df4.isnull().values.sum()) #for finding null values in the following dataset.
print('\nUnique values :  \n',df4.nunique())
print('\nStatical Measure of the data set   :\n',df4.describe()) # Statically computed values of the dataset.

Rows     : 211944
Columns  : 9

Features :
     : ['Res_Id', 'Rest_Name', 'Address', 'City - CityID', 'Region', 'Latitude', 'Longitude', 'PinCode', 'Region_Verbose']

Missing values    : 163321

Unique values :
 Res_Id            55568
Rest_Name         41097
Address           50657
City - CityID        99
Region             3731
Latitude          53356
Longitude         53318
PinCode            1303
Region_Verbose     3910
dtype: int64

Statical Measure of the data set   :
              Res_Id       Latitude      Longitude
count  2.119440e+05  211944.000000  211944.000000
mean   1.349411e+07      21.499758      77.615276
std    7.883722e+06      22.781331       7.500104
min    5.000000e+01       0.000000       0.000000
25%    3.301027e+06      15.496071      74.877961
50%    1.869573e+07      22.514494      77.425971
75%    1.881297e+07      26.841667      80.219323
max    1.915979e+07   10000.000000      91.832769

In [75]:
#Null Check
df4.isnull().sum()

Res_Id                 0
Rest_Name              0
Address              134
City - CityID          0
Region                 0
Latitude               0
Longitude              0
PinCode           163187
Region_Verbose         0
dtype: int64

In [76]:
df5 = df4.fillna(0)

In [77]:
#Null Check
df5.isnull().sum()

Res_Id            0
Rest_Name         0
Address           0
City - CityID     0
Region            0
Latitude          0
Longitude         0
PinCode           0
Region_Verbose    0
dtype: int64

In [78]:
# Rename coloumn name
df5.rename(columns = {'City - CityID':'CityID'}, inplace = True)

In [79]:
df5

,Res_Id,Rest_Name,Address,CityID,Region,Latitude,Longitude,PinCode,Region_Verbose
0,3400299,Farsanwala,"Kalyani Point, Near Tulsi Cinema, Bypass Road,...",Agra-34,Khandari,27.211450,78.002381,0,"Khandari, Agra"
1,3400005,Murgi and Franky House,"Main Market, Sadar Bazaar, Agra Cantt, Agra",Agra-34,Agra Cantt,27.160569,78.011583,282001,"Agra Cantt, Agra"
2,3401013,Halwai ka khajana,"62/1, Near Easy Day, West Shivaji Nagar, Goalp...",Agra-34,Shahganj,27.182938,77.979684,282010,"Shahganj, Agra"
3,3400290,Halwai ka khajana,"Near Anjana Cinema, Nehru Nagar, Civil Lines, ...",Agra-34,Civil Lines,27.205668,78.004799,282002,"Civil Lines, Agra"
4,3401744,Opal Kitchen Cafe and Bar,"1C,3rd Floor, Fatehabad Road, Tajganj, Agra",Agra-34,Tajganj,27.157709,78.052421,0,"Tajganj, Agra"
...,...,...,...,...,...,...,...,...,...
211939,3202251,Kali Mirch Cafe And Restaurant,"Manu Smriti Complex, Near Navrachna School, GI...",Vadodara-32,Fatehgunj,22.336931,73.192356,390024,"Fatehgunj, Vadodara"
211940,3200996,Raju Omlet,"Mahalaxmi Apartment, Opposite B O B, Karoli Ba...",Vadodara-32,Karelibaug,22.322455,73.197203,0,"Karelibaug, Vadodara"
211941,18984164,The Grand Thakar,"3rd Floor, Shreem Shalini Mall, Opposite Conqu...",Vadodara-32,Alkapuri,22.310563,73.171164,0,"Alkapuri, Vadodara"
211942,3201138,Fresh Bites,"G-2, Vedant Platina, Near Cosmos, Akota, Vadodara",Vadodara-32,Akota,22.270027,73.143068,0,"Akota, Vadodara"
211943,18879846,Freshco's - The Health Cafe,"Shop 7, Ground Floor, Opposite Natubhai Circle...",Vadodara-32,Vadiwadi,22.309935,73.158768,390007,"Vadiwadi, Vadodara"

In [80]:
cursor.execute("CREATE TABLE Load_Location(Res_Id int,Rest_Name varchar(1000), Address varchar(1000),CityID varchar(1000), Region varchar(1000),Latitude  float,Longitude  float,PinCode varchar(500),Region_Verbose varchar(1000))")

In [64]:
df5.dtypes

Res_Id              int64
Rest_Name          object
Address            object
CityID             object
Region             object
Latitude          float64
Longitude         float64
PinCode            object
Region_Verbose     object
dtype: object

In [81]:
for row in df5.itertuples():
    cursor.execute('''
    INSERT INTO testdatabase.dbo.Load_Location(Res_Id, Rest_Name, Address, CityID, Region, Latitude, Longitude, PinCode, Region_Verbose)
    VALUES(?,?,?,?,?,?,?,?,?)
    ''',
    row.Res_Id,
    row.Rest_Name,
    row.Address,
    row.CityID,
    row.Region,
    row.Latitude,
    row.Longitude,
    row.PinCode,
    row.Region_Verbose,
    )
conn.commit()